using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Coffee.Mitsubishi.Base
{
    internal class Status
    {
        public static Dictionary<string, string> Errors = new Dictionary<string, string>()
        {
            {"0055","将运行中写入设置为不允许时，通过对象设备向CPU模块发出了运行中数据写入请求" },
            {"C050","在“通信数据代码设置”中，设置了ASCII代码通信时，接收了不能转换为二进制代码的ASCII代码" },
            {"C051","写入或读取点数超出了允许范围" },
            {"C052","写入或读取点数超出了允许范围" },
            {"C053","写入或读取点数超出了允许范围" },
            {"C054","写入或读取点数超出了允许范围" },
            {"C056","写入及读取请求超出了最大地址" },
            {"C058","ASCII- 二进制转换后的请求数据长与字符部分(文本的一部分)的数据数不相符" },
            {"C059","指令、子指令的指定有误，或者在CPU模块中禁止使用的指令、子指令" },
            {"C05B","CPU 模块不能对指定软元件进行写入及读取" },
            {"C05C","请求内容中存在有错误。(以位为单位对字软元件进行了写入及读取等)" },
            {"C05D","未进行监视登录" },
            {"C05F","是不能对对象CPU模块执行的请求" },
            {"C060","请求内容中存在有错误。(对位软元件进行的数据指定中存在有错误等)" },
            {"C061","请求数据长与字符部分(文本的一部分)的数据数不相符" },
            {"C06F","“通信数据代码设置”为二进制时，接收了ASCII的请求报文。此外，设置为ASCII时，接收了二进制的请求报文" },
            {"C070","不能对对象站进行软元件存储器的扩展指定" },
            {"C200","远程口令有错误" },
            {"C201","通信所使用的端口处于远程口令的锁定状态。或者“通信数据代码设置”为ASCII代码时，由于处于远程口令的锁定状态，因此无法将子指令以后转换为二进制代码" },
            {"C204","与发出了远程口令解锁处理请求的对象设备不相同" },
        };
    }
}
